settings.org
* Detect system type
#+BEGIN_SRC emacs-lisp
(defconst sys/win32p
  (eq system-type 'windows-nt)
  "Are we running on a WinTel system?")
#+END_SRC

* Package installation
** Refresh package list
#+BEGIN_SRC emacs-lisp
(when (not package-archive-contents)
  (package-refresh-contents))
#+END_SRC
** Packages to retrieve from repo
#+BEGIN_SRC emacs-lisp
(defvar myPackages
  '(better-defaults
    flycheck ; syntax/grammar checker
    py-autopep8 ; allow autopep 8 reformating upon save
#+END_SRC
*** Ansible
#+BEGIN_SRC emacs-lisp
ansible
ansible-doc
ansible-vault
#+END_SRC
*** Misc
#+BEGIN_SRC emacs-lisp
0blayout ; window layout
ac-etags
ac-html
ac-html-csswatcher
ac-php
ace-window
all-the-icons
anzu ; display search number of matching occurences
desktop+
dtrt-indent
doom-modeline
emojify ; display emojis
fill-column-indicator
fontawesome
ggtags
git-gutter
git-messenger
helm
helm-swoop
ido
lv
magit ; git support
magit-gitflow
org-bullets
paradox ; better melpa browsing
phpunit
projectile
rainbow-delimiters ; matching parentheses colorization
sphinx-doc
treemacs
treemacs-projectile
use-package
use-package-ensure-system-package
which-key
ztree ; Directory tree diff
#+END_SRC
*** Themes
#+BEGIN_SRC emacs-lisp
badger-theme
zerodark-theme
monokai-theme
material-theme
zenburn-theme
gruvbox-theme
doom-themes
doom-modeline
spacemacs-theme
atom-one-dark-theme
#+END_SRC
*** Modes
#+BEGIN_SRC emacs-lisp
;;markdown-preview-mode
anaconda-mode
angular-mode
apache-mode
csv-mode
demangle-mode
docker
dotenv-mode
elpy ; python tool
groovy-mode
jinja2-mode
markdown-mode
nasm-mode
nginx-mode
npm-mode
php-mode
rainbow-mode
yaml-mode
))
#+END_SRC
** Actual installation
#+BEGIN_SRC emacs-lisp
(mapc #'(lambda (package)
	  (unless (package-installed-p package)
	    (package-install package)))
      myPackages)
#+END_SRC

* Themes
** Create themes directory
#+BEGIN_SRC emacs-lisp
;; Don't miss the trailing "/"
(setq my-themes-dir "~/.emacs.d/themes/")
(unless (file-directory-p my-themes-dir)
  (dired-create-directory my-themes-dir))
#+END_SRC

** Additional themes from github
#+BEGIN_SRC emacs-lisp
(defun clone-theme(git-url dst-dir-name)
  (shell-command
   (concat "git clone " git-url " " my-themes-dir dst-dir-name " 2> /dev/null || true")))

(let ((github-themes-url
       '(
	 ("https://github.com/ianpan870102/Emacs-Tron-Legacy-Theme" . "Emacs-Tron-Legacy-Theme")
	 )))

  (mapcar (lambda (element)
	    (let ((url (car element))
		  (dest (cdr element)))
	      (unless (file-directory-p dest)
		(clone-theme url dest)))
	    ) github-themes-url))
#+END_SRC

** Add all themes under ~/.emacs.d/themes directory to load-path
#+BEGIN_SRC emacs-lisp
(when (file-directory-p my-themes-dir)
  (dolist (f (directory-files my-themes-dir))
    (if (and (not (or (equal f ".") (equal f "..")))
             (file-directory-p (concat my-themes-dir f)))
        (add-to-list 'custom-theme-load-path (concat my-themes-dir f)))))

#+END_SRC
*** Github theme
#+BEGIN_SRC emacs-lisp
(use-package github-theme
  :ensure t
  :defer t
  )
#+END_SRC

*** Kaolin themes
#+BEGIN_SRC emacs-lisp
(use-package kaolin-themes
  :ensure t
  :defer t
  )
#+END_SRC

** Load themes
***
This package advises the `enable-theme' function and convert non-terminal colors to their closest approximation. Inspired by VIM's CSApprox plugin
http://www.vim.org/scripts/script.php?script_id=2390

Normally Emacs does have non-terminal color themes degrade, however in some system the effect is pretty poor. I've encountered this on Arch Linux and Ubuntu (probably caused by some libvte weirdness).
#+BEGIN_SRC emacs-lisp
(use-package color-theme-approximate
  :ensure t
  :if (not (window-system))
  :init
  (autoload 'color-theme-approximate-on "color-theme-approximate")
  (color-theme-approximate-on)
  )
#+END_SRC
*** Disable active theme when loading a new one

See https://www.simplify.ba/articles/2016/02/13/loading-and-unloading-emacs-themes/

#+BEGIN_SRC emacs-lisp
(defun load-theme--disable-old-theme(theme &rest args)
  "Disable current theme before loading new one."
  (mapcar #'disable-theme custom-enabled-themes))
(advice-add 'load-theme :before #'load-theme--disable-old-theme)
#+END_SRC

Load different themes for console and graphic mode
#+BEGIN_SRC emacs-lisp
(load-theme 'doom-acario-dark t)
#+END_SRC

* Buffer/Window helpers
** Kill buffer using f9
#+BEGIN_SRC emacs-lisp
(global-set-key [f9] 'kill-this-buffer)
#+END_SRC
** Window resize shortcuts
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "S-C-<left>") 'shrink-window-horizontally)
(global-set-key (kbd "S-C-<right>") 'enlarge-window-horizontally)
(global-set-key (kbd "S-C-<down>") 'shrink-window)
(global-set-key (kbd "S-C-<up>") 'enlarge-window)
#+END_SRC
** Balanced windows
#+BEGIN_SRC emacs-lisp
(use-package balanced-windows
  :ensure t
  :config
  (balanced-windows-mode)
)
#+END_SRC
** Window move
#+BEGIN_SRC emacs-lisp
(windmove-default-keybindings 'meta)
(when (fboundp 'windmove-default-keybindings)
  (windmove-default-keybindings))
#+END_SRC
** Temporary buffer full screen with Ctrl + f11
#+BEGIN_SRC emacs-lisp
(defun toggle-maximize-buffer () "Maximize buffer"
       (interactive)
       (if (= 1 (length (window-list)))
           (jump-to-register '_)
         (progn
           (window-configuration-to-register '_)
           (delete-other-windows))))
(global-set-key [(ctrl f11)] 'toggle-maximize-buffer)
#+END_SRC
** Transparency
#+BEGIN_SRC emacs-lisp
;; https://www.emacswiki.org/emacs/TransparentEmacs
(defun toggle-transparency ()
  (interactive)
  (let ((alpha (frame-parameter nil 'alpha)))
    (set-frame-parameter nil 'alpha
			 (if (eql (cond ((numberp alpha) alpha)
					((numberp (cdr alpha)) (cdr alpha))
					;; Also handle undocumented (<active> <inactive>) form.
					((numberp (cadr alpha)) (cadr alpha)))
				  100)
			     '(90 . 90) '(100 . 100))))) ;;active/inactive frame transparency
(global-set-key (kbd "C-c T") 'toggle-transparency)

;; Set transparency of emacs
(defun transparency (value)
  "Sets the transparency of the frame window. 0=transparent/100=opaque"
  (interactive "nTransparency Value 0 - 100 opaque:")
  (set-frame-parameter (selected-frame) 'alpha value))
#+END_SRC
** Font size
To use: M-x x-setface-height RET 100 RET
#+BEGIN_SRC emacs-lisp
(defun x-setface-height (number)
  "Face height is set to NUMBER."
  (interactive "nInsert number: ")
  (set-face-attribute 'default (selected-frame) :height number))

(global-set-key (kbd "C-c o") (lambda() (interactive) (x-setface-height 80)))
(global-set-key (kbd "C-c O") (lambda() (interactive) (x-setface-height 100)))

#+END_SRC
** Ace window
#+BEGIN_SRC emacs-lisp
(use-package ace-window
  :ensure t
  :init
  (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
  :bind ("M-o" . ace-window)
)

#+END_SRC
** Mouse & Smooth Scroll
#+BEGIN_SRC emacs-lisp
;; Scroll one line at a time (less "jumpy" than defaults)
(setq mouse-wheel-scroll-amount '(1 ((shift) . 1)))
(setq mouse-wheel-progressive-speed nil)
(setq scroll-step 1
      scroll-margin 0
      scroll-conservatively 100000)
#+END_SRC
** Display time
#+BEGIN_SRC emacs-lisp
;; Display Time
(use-package time
  :ensure nil
  :unless (display-graphic-p)
  :hook (after-init . display-time-mode)
  :init
  (setq display-time-24hr-format t)
  (setq display-time-day-and-date t))
#+END_SRC

** Suppress GUI features
#+BEGIN_SRC emacs-lisp
(setq use-file-dialog nil)
(setq use-dialog-box nil)
(setq inhibit-startup-screen t)
#+END_SRC

** Visible bell
#+BEGIN_SRC emacs-lisp
(setq visible-bell t)
#+END_SRC

** Size indication mode
#+BEGIN_SRC emacs-lisp
(size-indication-mode 1)
#+END_SRC

** Blink cursor
#+BEGIN_SRC emacs-lisp
;; (blink-cursor-mode -1)
#+END_SRC

** Track EOL
#+BEGIN_SRC emacs-lisp
(setq line-move-visual nil)
(setq track-eol t)                      ; Keep cursor at end of lines. Require line-move-visual is nil.
#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq inhibit-compacting-font-caches t) ; Don’t compact font caches during GC.

;; Don't open a file in a new frame
(when (boundp 'ns-pop-up-frames)
(setq ns-pop-up-frames nil))

;; Don't use GTK+ tooltip
(when (boundp 'x-gtk-use-system-tooltips)
(setq x-gtk-use-system-tooltips nil))
#+END_SRC

** Basic Interface Settings
These are setting that do not depend on packages and are built-in enhancements to the UI.

***** Looks
******* Remove lame startup screen
We use an actual replacement for it, keep reading or head directly to =dashboard=.

#+BEGIN_SRC emacs-lisp
(setq inhibit-startup-message t)
#+END_SRC
******* Disable menus and scrollbars
If you like using any of those, change =-1= to =1=.
#+BEGIN_SRC emacs-lisp
(tool-bar-mode -1)
(menu-bar-mode -1)
;; Scroll bar mode is not defined depending on emacs build option
(if (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))
#+END_SRC
******* Disable bell
This is annoying, remove this line if you like being visually reminded of events.
#+BEGIN_SRC emacs-lisp
(setq ring-bell-function 'ignore)
#+END_SRC
******* Set UTF-8 encoding
#+BEGIN_SRC emacs-lisp
(setq locale-coding-system 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-selection-coding-system 'utf-8)
(prefer-coding-system 'utf-8)
#+END_SRC
******* Highligh current line
=hl-line= is awesome! It's not very awesome in the terminal version of emacs though, so we don't use that.
Besides, it's only used for programming.
#+BEGIN_SRC emacs-lisp
(when window-system (add-hook 'prog-mode-hook 'hl-line-mode))
#+END_SRC
