settings.el
(defconst sys/win32p
  (eq system-type 'windows-nt)
  "Are we running on a WinTel system?")

(when (not package-archive-contents)
  (package-refresh-contents))

(defvar myPackages
  '(better-defaults
    flycheck ; syntax/grammar checker
    py-autopep8 ; allow autopep 8 reformating upon save

ansible
ansible-doc
ansible-vault

0blayout ; window layout
ac-etags
ac-html
ac-html-csswatcher
ac-php
ace-window
all-the-icons
anzu ; display search number of matching occurences
desktop+
dtrt-indent
doom-modeline
emojify ; display emojis
fill-column-indicator
fontawesome
ggtags
git-gutter
git-messenger
helm
helm-swoop
ido
lv
magit ; git support
magit-gitflow
org-bullets
paradox ; better melpa browsing
phpunit
projectile
rainbow-delimiters ; matching parentheses colorization
sphinx-doc
treemacs
treemacs-projectile
use-package
use-package-ensure-system-package
which-key
ztree ; Directory tree diff

badger-theme
zerodark-theme
monokai-theme
material-theme
zenburn-theme
gruvbox-theme
doom-themes
doom-modeline
spacemacs-theme
atom-one-dark-theme

;;markdown-preview-mode
anaconda-mode
angular-mode
apache-mode
csv-mode
demangle-mode
docker
dotenv-mode
elpy ; python tool
groovy-mode
jinja2-mode
markdown-mode
nasm-mode
nginx-mode
npm-mode
php-mode
rainbow-mode
yaml-mode
))

(mapc #'(lambda (package)
	  (unless (package-installed-p package)
	    (package-install package)))
      myPackages)

;; Don't miss the trailing "/"
(setq my-themes-dir "~/.emacs.d/themes/")
(unless (file-directory-p my-themes-dir)
  (dired-create-directory my-themes-dir))

(defun clone-theme(git-url dst-dir-name)
  (shell-command
   (concat "git clone " git-url " " my-themes-dir dst-dir-name " 2> /dev/null || true")))

(let ((github-themes-url
       '(
	 ("https://github.com/ianpan870102/Emacs-Tron-Legacy-Theme" . "Emacs-Tron-Legacy-Theme")
	 )))

  (mapcar (lambda (element)
	    (let ((url (car element))
		  (dest (cdr element)))
	      (unless (file-directory-p dest)
		(clone-theme url dest)))
	    ) github-themes-url))

(when (file-directory-p my-themes-dir)
  (dolist (f (directory-files my-themes-dir))
    (if (and (not (or (equal f ".") (equal f "..")))
             (file-directory-p (concat my-themes-dir f)))
        (add-to-list 'custom-theme-load-path (concat my-themes-dir f)))))

(use-package github-theme
  :ensure t
  :defer t
  )

(use-package kaolin-themes
  :ensure t
  :defer t
  )

(use-package color-theme-approximate
  :ensure t
  :if (not (window-system))
  :init
  (autoload 'color-theme-approximate-on "color-theme-approximate")
  (color-theme-approximate-on)
  )

(defun load-theme--disable-old-theme(theme &rest args)
  "Disable current theme before loading new one."
  (mapcar #'disable-theme custom-enabled-themes))
(advice-add 'load-theme :before #'load-theme--disable-old-theme)

(load-theme 'doom-acario-dark t)

(global-set-key [f9] 'kill-this-buffer)

(global-set-key (kbd "S-C-<left>") 'shrink-window-horizontally)
(global-set-key (kbd "S-C-<right>") 'enlarge-window-horizontally)
(global-set-key (kbd "S-C-<down>") 'shrink-window)
(global-set-key (kbd "S-C-<up>") 'enlarge-window)

(use-package balanced-windows
  :ensure t
  :config
  (balanced-windows-mode)
)

(windmove-default-keybindings 'meta)
(when (fboundp 'windmove-default-keybindings)
  (windmove-default-keybindings))

(defun toggle-maximize-buffer () "Maximize buffer"
       (interactive)
       (if (= 1 (length (window-list)))
           (jump-to-register '_)
         (progn
           (window-configuration-to-register '_)
           (delete-other-windows))))
(global-set-key [(ctrl f11)] 'toggle-maximize-buffer)

;; https://www.emacswiki.org/emacs/TransparentEmacs
(defun toggle-transparency ()
  (interactive)
  (let ((alpha (frame-parameter nil 'alpha)))
    (set-frame-parameter nil 'alpha
			 (if (eql (cond ((numberp alpha) alpha)
					((numberp (cdr alpha)) (cdr alpha))
					;; Also handle undocumented (<active> <inactive>) form.
					((numberp (cadr alpha)) (cadr alpha)))
				  100)
			     '(90 . 90) '(100 . 100))))) ;;active/inactive frame transparency
(global-set-key (kbd "C-c T") 'toggle-transparency)

;; Set transparency of emacs
(defun transparency (value)
  "Sets the transparency of the frame window. 0=transparent/100=opaque"
  (interactive "nTransparency Value 0 - 100 opaque:")
  (set-frame-parameter (selected-frame) 'alpha value))

(defun x-setface-height (number)
  "Face height is set to NUMBER."
  (interactive "nInsert number: ")
  (set-face-attribute 'default (selected-frame) :height number))

(global-set-key (kbd "C-c o") (lambda() (interactive) (x-setface-height 80)))
(global-set-key (kbd "C-c O") (lambda() (interactive) (x-setface-height 100)))

(use-package ace-window
  :ensure t
  :init
  (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
  :bind ("M-o" . ace-window)
)

;; Scroll one line at a time (less "jumpy" than defaults)
(setq mouse-wheel-scroll-amount '(1 ((shift) . 1)))
(setq mouse-wheel-progressive-speed nil)
(setq scroll-step 1
      scroll-margin 0
      scroll-conservatively 100000)

;; Display Time
(use-package time
  :ensure nil
  :unless (display-graphic-p)
  :hook (after-init . display-time-mode)
  :init
  (setq display-time-24hr-format t)
  (setq display-time-day-and-date t))

(setq use-file-dialog nil)
(setq use-dialog-box nil)
(setq inhibit-startup-screen t)

(setq visible-bell t)

(size-indication-mode 1)

;; (blink-cursor-mode -1)

(setq line-move-visual nil)
(setq track-eol t)                      ; Keep cursor at end of lines. Require line-move-visual is nil.

(setq inhibit-compacting-font-caches t) ; Don’t compact font caches during GC.

;; Don't open a file in a new frame
(when (boundp 'ns-pop-up-frames)
(setq ns-pop-up-frames nil))

;; Don't use GTK+ tooltip
(when (boundp 'x-gtk-use-system-tooltips)
(setq x-gtk-use-system-tooltips nil))

(setq inhibit-startup-message t)

(tool-bar-mode -1)
(menu-bar-mode -1)
;; Scroll bar mode is not defined depending on emacs build option
(if (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))

(setq ring-bell-function 'ignore)

(setq locale-coding-system 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-selection-coding-system 'utf-8)
(prefer-coding-system 'utf-8)

(when window-system (add-hook 'prog-mode-hook 'hl-line-mode))

(when window-system
  (use-package pretty-mode
    :ensure t
    :config
    (global-pretty-mode t)))
