settings.org
** Common settings

#+BEGIN_SRC emacs-lisp
(setq org-ellipsis " ")
(setq org-src-fontify-natively t)
(setq org-src-tab-acts-natively t)
(setq org-confirm-babel-evaluate nil)
(setq org-export-with-smart-quotes t)
(setq org-src-window-setup 'current-window)
(setq org-catch-invisible-edits 'show-and-error)
(setq org-cycle-separator-lines 0)
(add-hook 'org-mode-hook 'org-indent-mode)

#+END_SRC

** Syntax highlighting for documents exported to HTML
#+BEGIN_SRC emacs-lisp
(use-package htmlize
  :ensure t)
#+END_SRC

** Line wrapping
#+BEGIN_SRC emacs-lisp
(add-hook 'org-mode-hook
	  '(lambda ()
	     (visual-line-mode 1)))
#+END_SRC

** Keybindings
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-c '") 'org-edit-src-code)
#+END_SRC

** Org Bullets
Makes it all look a bit nicer, I hate looking at asterisks.
#+BEGIN_SRC emacs-lisp
(use-package org-bullets
  :ensure t
  :config
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode))))
#+END_SRC

** Easy-to-add emacs-lisp template
Hitting tab after an "<el" in an org-mode file will create a template for elisp insertion.
#+BEGIN_SRC emacs-lisp
(add-to-list 'org-structure-template-alist
             '("el" "#+BEGIN_SRC emacs-lisp\n?\n#+END_SRC"))
#+END_SRC

** Exporting options
One of the best things about org is the ability to export your file to many formats.
Here is how we add more of them!

*** latex
#+BEGIN_SRC emacs-lisp
(when (file-directory-p "/usr/share/emacs/site-lisp/tex-utils")
  (add-to-list 'load-path "/usr/share/emacs/site-lisp/tex-utils")
  (require 'xdvi-search))
#+END_SRC

** Jump to todo list
#+BEGIN_SRC emacs-lisp
(defun todo-visit ()
  (interactive)
  (find-file "~/notes.org"))
(global-set-key (kbd "C-c t") 'todo-visit)
#+END_SRC
** Todo keywords
#+BEGIN_SRC emacs-lisp
(setq org-todo-keywords '((sequence "TODO" "WIP" "BLOCKED" "DONE")))
#+END_SRC

* Diminishing modes
Your modeline is sacred, and if you have a lot of modes enabled, as you will if you use this config,
you might end up with a lot of clutter there, the package =diminish= disables modes on the mode line but keeps
them running, it just prevents them from showing up and taking up space.

*THIS WILL BE REMOVED SOON AS USE-PACKAGE HAS THE FUNCTIONALITY BUILT IN*

Edit this list as you see fit!
#+BEGIN_SRC emacs-lisp
(use-package diminish
  :ensure t
  :init
  (diminish 'which-key-mode)
  (diminish 'linum-relative-mode)
  (diminish 'hungry-delete-mode)
  (diminish 'visual-line-mode)
  (diminish 'subword-mode)
  (diminish 'beacon-mode)
  (diminish 'irony-mode)
  (diminish 'page-break-lines-mode)
  (diminish 'auto-revert-mode)
  (diminish 'rainbow-delimiters-mode)
  (diminish 'rainbow-mode)
  (diminish 'yas-minor-mode)
  (diminish 'flycheck-mode)
  (diminish 'helm-mode))
#+END_SRC

* Copy/Paste from/to X clipboard

Lets M-c and M-v to copy and paste from X. To do that, we first need to define
the following functions, found on https://github.com/dpsxp/emacs-setup

#+BEGIN_SRC emacs-lisp
(defun copy-to-clipboard ()
  (interactive)
  (if (display-graphic-p)
      (progn
        (message "Yanked region to x-clipboard!")
        (call-interactively 'clipboard-kill-ring-save)
        )
    (if (region-active-p)
        (progn
          (shell-command-on-region (region-beginning) (region-end) "xsel -i -b")
          (message "Yanked region to clipboard!")
          (deactivate-mark))
      (message "No region active; can't yank to clipboard!"))))
(setq x-select-enable-clipboard nil)
(defun paste-from-clipboard ()
  (interactive)
  (setq x-select-enable-clipboard t)
  (yank)
  (setq x-select-enable-clipboard nil))

(global-set-key (kbd "M-c") 'copy-to-clipboard)
(global-set-key (kbd "M-v") 'paste-from-clipboard)
#+END_SRC

* Fill column indicator
#+BEGIN_SRC emacs-lisp
(use-package fill-column-indicator
  :ensure t
  :diminish ""
  )
#+END_SRC

* White Spaces

For now, I stick to 2-spaces over tabs when I can. But there are some folks ou*t
there who do not think the way I do and I want to be able to work with them. The
dtrt-indent_ package provides a way for emacs to guess which indentation rules
to follow based on the current file.

#+BEGIN_SRC emacs-lisp
(setq-default indent-tabs-mode nil)
(use-package dtrt-indent
  :ensure t
  :diminish ""
  :config
  (progn
    (add-hook 'prog-mode-hook (lambda ()  (dtrt-indent-mode 1)))))
#+END_SRC

* Dumb-jump

#+BEGIN_SRC emacs-lisp
(use-package dumb-jump
  :ensure t
  :init
  (dumb-jump-mode)
  :bind (("M-g o" . dumb-jump-go-other-window)
         ("M-g j" . dumb-jump-go)
         ("M-g x" . dumb-jump-go-prefer-external)
         ("M-g z" . dumb-jump-go-prefer-external-other-window))
  :config (setq dumb-jump-selector 'helm)
  )
#+END_SRC
* Debug helpers
** Package signature failed
#+BEGIN_SRC shell-script
gpg --homedir $HOME/.emacs.d/elpa/gnupg  --keyserver keyserver.ubuntu.com --recv-keys 066DAFCB81E42C40
#+END_SRC

* Keychord
#+BEGIN_SRC emacs-lisp
(use-package key-chord
  :ensure t
  :config
  (key-chord-define-global "JJ" 'avy-goto-word-1)
  (key-chord-define-global "JL" 'avy-goto-line)
  (key-chord-define-global "JK" 'avy-goto-char)
  (key-chord-define-global "JJ" 'crux-switch-to-previous-buffer)
  (key-chord-define-global "XX" 'execute-extended-command)
  (key-chord-define-global "YY" 'browse-kill-ring)
  (key-chord-define-global "VV" 'helm-M-x)
  (key-chord-define-global "FF" 'helm-find-files)
  (key-chord-define-global "PP" 'projectile-switch-project)
  (key-chord-define-global "PF" 'projectile-find-file)
  (key-chord-define-global "PS" 'projectile-ag)
  (key-chord-define-global "PR" 'projectile-replace)

  (key-chord-mode +1))
#+END_SRC

* Restclient
#+BEGIN_SRC emacs-lisp
(use-package restclient
  :ensure t
  :defer t
)
#+END_SRC
* Pretty mode
#+BEGIN_SRC emacs-lisp
(use-package pretty-mode
  :ensure t
  :config
  (global-pretty-mode t)
)
#+END_SRC
* Log4j
#+BEGIN_SRC emacs-lisp
(use-package log4j-mode
  :ensure t
  :defer t
)
#+END_SRC
* epoch-view
#+BEGIN_SRC emacs-lisp
(use-package epoch-view
  :ensure t
  :defer t
)
#+END_SRC
* magic-theme
#+BEGIN_SRC emacs-lisp
(use-package theme-magic
  :ensure t
  :defer t
)
#+END_SRC
* Github review
Please refer to package documentation to configure Github Enterprise

#+BEGIN_SRC emacs-lisp
(use-package github-review
  :ensure t
  :defer t
)
#+END_SRC
* Forge
#+BEGIN_SRC emacs-lisp
(use-package forge
  :ensure t
  :defer t
)
#+END_SRC
