settings.el

(setq org-ellipsis " ")
(setq org-src-fontify-natively t)
(setq org-src-tab-acts-natively t)
(setq org-confirm-babel-evaluate nil)
(setq org-export-with-smart-quotes t)
(setq org-src-window-setup 'current-window)
(setq org-catch-invisible-edits 'show-and-error)
(setq org-cycle-separator-lines 0)
(add-hook 'org-mode-hook 'org-indent-mode)

(use-package htmlize
  :ensure t)

(add-hook 'org-mode-hook
	  '(lambda ()
	     (visual-line-mode 1)))

(global-set-key (kbd "C-c '") 'org-edit-src-code)

(use-package org-bullets
  :ensure t
  :config
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode))))

(add-to-list 'org-structure-template-alist
             '("el" "#+BEGIN_SRC emacs-lisp\n?\n#+END_SRC"))

(when (file-directory-p "/usr/share/emacs/site-lisp/tex-utils")
  (add-to-list 'load-path "/usr/share/emacs/site-lisp/tex-utils")
  (require 'xdvi-search))

(defun todo-visit ()
  (interactive)
  (find-file "~/notes.org"))
(global-set-key (kbd "C-c t") 'todo-visit)

(setq org-todo-keywords '((sequence "TODO" "WIP" "BLOCKED" "DONE")))

(use-package diminish
  :ensure t
  :init
  (diminish 'which-key-mode)
  (diminish 'linum-relative-mode)
  (diminish 'hungry-delete-mode)
  (diminish 'visual-line-mode)
  (diminish 'subword-mode)
  (diminish 'beacon-mode)
  (diminish 'irony-mode)
  (diminish 'page-break-lines-mode)
  (diminish 'auto-revert-mode)
  (diminish 'rainbow-delimiters-mode)
  (diminish 'rainbow-mode)
  (diminish 'yas-minor-mode)
  (diminish 'flycheck-mode)
  (diminish 'helm-mode))

(defun copy-to-clipboard ()
  (interactive)
  (if (display-graphic-p)
      (progn
        (message "Yanked region to x-clipboard!")
        (call-interactively 'clipboard-kill-ring-save)
        )
    (if (region-active-p)
        (progn
          (shell-command-on-region (region-beginning) (region-end) "xsel -i -b")
          (message "Yanked region to clipboard!")
          (deactivate-mark))
      (message "No region active; can't yank to clipboard!"))))
(setq x-select-enable-clipboard nil)
(defun paste-from-clipboard ()
  (interactive)
  (setq x-select-enable-clipboard t)
  (yank)
  (setq x-select-enable-clipboard nil))

(global-set-key (kbd "M-c") 'copy-to-clipboard)
(global-set-key (kbd "M-v") 'paste-from-clipboard)

(use-package fill-column-indicator
  :ensure t
  :diminish ""
  )

(setq-default indent-tabs-mode nil)
(use-package dtrt-indent
  :ensure t
  :diminish ""
  :config
  (progn
    (add-hook 'prog-mode-hook (lambda ()  (dtrt-indent-mode 1)))))

(use-package dumb-jump
  :ensure t
  :init
  (dumb-jump-mode)
  :bind (("M-g o" . dumb-jump-go-other-window)
         ("M-g j" . dumb-jump-go)
         ("M-g x" . dumb-jump-go-prefer-external)
         ("M-g z" . dumb-jump-go-prefer-external-other-window))
  :config (setq dumb-jump-selector 'helm)
  )

(use-package key-chord
  :ensure t
  :config
  (key-chord-define-global "JJ" 'avy-goto-word-1)
  (key-chord-define-global "JL" 'avy-goto-line)
  (key-chord-define-global "JK" 'avy-goto-char)
  (key-chord-define-global "JJ" 'crux-switch-to-previous-buffer)
  (key-chord-define-global "XX" 'execute-extended-command)
  (key-chord-define-global "YY" 'browse-kill-ring)
  (key-chord-define-global "VV" 'helm-M-x)
  (key-chord-define-global "FF" 'helm-find-files)
  (key-chord-define-global "PP" 'projectile-switch-project)
  (key-chord-define-global "PF" 'projectile-find-file)
  (key-chord-define-global "PS" 'projectile-ag)
  (key-chord-define-global "PR" 'projectile-replace)

  (key-chord-mode +1))

(use-package restclient
  :ensure t
  :defer t
)

(use-package pretty-mode
  :ensure t
  :config
  (global-pretty-mode t)
)

(use-package log4j-mode
  :ensure t
  :defer t
)

(use-package epoch-view
  :ensure t
  :defer t
)

(use-package theme-magic
  :ensure t
  :defer t
)

(use-package github-review
  :ensure t
  :defer t
)

(use-package forge
  :ensure t
  :defer t
)
